{
   "questions":[
      {
         "question":"You have been offered a new position in a company where you have worked for some time. The first question that is likely to come to mind is:",
         "responses":[
            "What if I can't live up to the new responsibility?",
            "Will I make more at this position?",
            "I wonder if the new work will be interesting."
         ]
      },
      {
         "question":"You had a job interview several weeks ago. In the mail you received a form letter which states that the position has been filled. It is likely that you might think:",
         "responses":[
            "It's not what you know, but who you know.",
            "I'm probably not good enough for the job.",
            "Somehow they didn't see my qualifications as matching their needs."
         ]
      },
      {
         "question":"You are a plant supervisor and have been charged with the task of allotting coffee breaks to three workers who cannot all break at once. You would likely handle this by:",
         "responses":[
            "Telling the three workers the situation and having them work with you on the schedule.",
            "Simply assigning times that each can break to avoid any problems.",
            "Find out from someone in authority what to do or do what was done in the past."
         ]
      },
      {
         "question":"You have just received the results of a test you took, and you discovered that you did very poorly. Your initial reaction is likely to be:",
         "responses":[
            "'I can't do anything right,' and feel sad.",
            "'I wonder how it is I did so poorly,' and feel disappointed.",
            "'That stupid test doesn't show anything,' and feel angry."
         ]
      },
      {
         "question":"When you and your friend are making plans for Saturday evening, it is likely that you would:",
         "responses":[
            "Leave it up to your friend; he (she) probably wouldn’t want to do what you’d suggest.",
            "Each make suggestions and then decide together on something that you both feel like doing. ",
            "Talk your friend into doing what you want to do."
         ]
      },
      {
         "question":"You have been invited to a large party where you know very few people. As you look forward to the evening, you would likely expect that:",
         "responses":[
            "You'll try to fit in with whatever is happening in order to have a good time and not look bad.",
            "You'll find some people with whom you can relate.",
            "You'll probably feel somewhat isolated and unnoticed."
         ]
      },
      {
         "question":"You are asked to plan a picnic for yourself and your fellow employees. Your style for approaching this project could most likely be characterized as:",
         "responses":[
            "Take charge: that is, you would make most of the major decisions yourself.",
            "Follow precedent: you're not really up to the task so you'd do it the way it's been done before.",
            "Seek participation: get inputs from others who want to make them before you make the final plans."
         ]
      },
      {
         "question":"Recently a position opened up at your place of work that could have meant a promotion for you. However, a person you work with was offered the job rather than you. In evaluating the situation, you're likely to think:",
         "responses":[
            "You didn't really expect the job; you frequently get passed over.",
            "The other person probably 'did the right things' politically to get the job.",
            "You would probably take a look at factors in your own performance that led you to be passed over."
         ]
      },
      {
         "question":"You are embarking on a new career. The most important consideration is likely to be:",
         "responses":[
            "Whether you can do the work without getting in over your head.",
            "How interested you are in that kind of work.",
            "Whether there are good possibilities for advancement."
         ]
      },
      {
         "question":"A woman who works for you has generally done an adequate job. However, for the past two weeks her work has not been up to par and she appears to be less actively interested  in her work.Your reaction is likely to be: ",
         "responses":[
            "Tell her that her work is below what is expected and that she should start working harder.",
            "Ask her about the problem and let her know you are available to help work it out.",
            "It's hard to know what to do to get her straightened out."
         ]
      },
      {
         "question":"Your company has promoted you to a position in a city far from your present location. As you think about the move you would probably:",
         "responses":[
            "Feel interested in the new challenge and a little nervous at the same time.",
            "Feel excited about the higher status and salary that is involved.",
            "Feel stressed and anxious about the upcoming changes."
         ]
      },
      {
         "question":"Within your circle of friends, the one with whom you choose to spend the most time is:",
         "responses":[
            "The one with whom you spend the most time exchanging ideas and feelings.",
            "The one who is the most popular of them.",
            "The one who needs you the most as a friend."
         ]
      },
      {
         "question":"You have a school-age daughter. On parents' night the teacher tells you that your daughter is doing poorly and doesn't seem involved in the work. You are likely to:",
         "responses":[
            "Talk it over with your daughter to understand further what the problem is.",
            "Scold her and hope she does better.",
            "Make sure she does the assignments, because she should be working harder."
         ]
      },
      {
         "question":"Your friend has a habit that annoys you to the point of making you angry. It is likely that you would:",
         "responses":[
            "Point it out each time you notice it, that way maybe he(she) will stop doing it.",
            "Try to ignore the habit because talking about it won’t do any good anyway.",
            "Try to understand why your partner does it and why it is so upsetting for you."
         ]
      },
      {
         "question":"A close (same-sex) friend of yours has been moody lately, and a couple of times has become very angry with you over 'nothing.'' You might:",
         "responses":[
            "Share your observations with him/her and try to find out what is going on for him/her.",
            "Ignore it because there's not much you can do about it anyway.",
            "Tell him/her that you're willing to spend time together if and only if he/she makes more effort to control him / herself."
         ]
      },
      {
         "question":"Your friend’s younger sister is a freshman in college. Your friend tells you that she has  been doing badly and asks you what he (she) should do about it. You advise him (her) to:",
         "responses":[
            "Talk it over with her and try to see what is going on for her.",
            "Not mention it; there’s nothing he (she) could do about it anyway.",
            "Tell her it’s important for her to do well, so she should be working harder."
         ]
      },
      {
         "question":"You feel that your friend is being inconsiderate. You would probably:",
         "responses":[
            "Find an opportunity to explain why it bothers you; he (she) may not even realize how much it is bothering you.",
            "Say nothing; if your friend really cares about you he (she) would understand how you fell.",
            "Demand that your friend start being more considerate; otherwise you’ll respond in kind."
         ]
      }
   ],
   "coding":{
     "A": [3,3,1,2,2,2,3,3,2,2,1,1,1,3,1,1,1],
     "C": [2,1,2,3,3,1,1,2,3,1,2,2,3,1,3,3,3],
     "I": [1,2,3,1,1,3,2,1,1,3,3,3,2,2,2,2,2]
   },
   "distribution": {
     "all" : {
       "A": {"mean": 70.54 , "sd": 6.62},
       "C": {"mean": 49.05, "sd": 8.13},
       "I": {"mean": 39.03, "sd": 8.99}
     },
     "male" : {
       "A": {"mean": 68.83, "sd": 6.21},
       "C": {"mean": 50.51, "sd": 7.52},
       "I": {"mean": 38.94, "sd": 8.99}
     },
     "female" : {
       "A": {"mean": 71.89, "sd": 6.29},
       "C": {"mean": 47.83, "sd": 8.01},
       "I": {"mean": 39.25, "sd": 8.76}
     }
   }
}
